# 1. Series   
1차원 배열 자료구조

In [1]:
import pandas as pd

In [2]:
ser = pd.Series(['a','b','c',3])
ser

0    a
1    b
2    c
3    3
dtype: object

In [3]:
ser.values

array(['a', 'b', 'c', 3], dtype=object)

In [4]:
ser.index

RangeIndex(start=0, stop=4, step=1)

## series 가 구조화된 데이터를 표현할 수 있는 이유는   
## 인덱스에 다른 값을 넣을 수 있기 때문이다

In [5]:
ser2 = pd.Series(['a','b','c',3], index = ['i','j', 'k', 'h'])   # 시리즈를 만들 때 인덱스 지정
ser2

i    a
j    b
k    c
h    3
dtype: object

In [6]:
ser2.index = ['j', 'k', 'l', 'n']                  # 시리즈를 만들고 나서 나중에 인덱스 재지정 
ser2

j    a
k    b
l    c
n    3
dtype: object

## 딕셔너리 타입의 데이터는 시리즈 객체로 바로 바꿀 수 있다.

In [7]:
Country_PhoneNumber = {'Korea': 82, 'America': 1, 'Swiss': 41, 'Italy': 39, 'Japan': 81, 'China': 86, 'Rusia': 7}
ser3 = pd.Series(Country_PhoneNumber)
ser3

Korea      82
America     1
Swiss      41
Italy      39
Japan      81
China      86
Rusia       7
dtype: int64

In [8]:
ser3['Korea']   # 딕셔너리 처럼 사용 가능

82

In [9]:
ser3['Italy':]   # 리스트처럼 슬라이싱도 가능

Italy    39
Japan    81
China    86
Rusia     7
dtype: int64

In [10]:
ser3.name = 'Country_PhoneNumber'     # series 객체에 이름 설정 가능

ser3.index.name = 'Country_Name'      # series Index에 이름 설정 가능
ser3

Country_Name
Korea      82
America     1
Swiss      41
Italy      39
Japan      81
China      86
Rusia       7
Name: Country_PhoneNumber, dtype: int64


# 2. DataFrame

dataframe은 칼럼을 여러개 나타낼 수 있다.   cf) dataframe은 series의 확장판

In [11]:
data = {'Region' : ['Korea', 'America', 'Chaina', 'Canada', 'Italy'],    # 키 : 밸류 에서  밸류에 키를 또 넣은 셈 (이것들이 인덱스 네임)
        'Sales' : [300, 200, 500, 150, 50],                             # 키들이 칼럼 네임
        'Amount' : [90, 80, 100, 30, 10],
        'Employee' : [20, 10, 30, 5, 3]
        }
s = pd.Series(data)
print(s, "\n")

df = pd.DataFrame(data)               # 데이터 프레임 만들기
print(df)

Region      [Korea, America, Chaina, Canada, Italy]
Sales                      [300, 200, 500, 150, 50]
Amount                        [90, 80, 100, 30, 10]
Employee                         [20, 10, 30, 5, 3]
dtype: object

    Region  Sales  Amount  Employee
0    Korea    300      90        20
1  America    200      80        10
2   Chaina    500     100        30
3   Canada    150      30         5
4    Italy     50      10         3

**시리즈의 index name은 데이터프레임의 Column name이다**

# EDA (exploratory data analysis = 데이터 탐색)

판다스 라이브러리는 수학 메서드와 통계 메서드를 기본으로 가지고 있다   
데이터의 대표값과 분산을 구하는 건 EDA의 기본

## 데이터 읽기
   
   
### csv 파일인 경우   
   
**변수 = pd.read_csv(데이터 경로)**   
   
csv파일을 DataFrame 객체로 읽는다
   
**변수.head()**   
      
      
**변수.tail()**
   

   
기본 5개씩 보여주는데, (100) 이렇게 정수인자를 넣으면 출력 행 개수 조절 가능

In [12]:
df.columns                              # DataFrame의 가장 큰 특징은 column이 여러개 라는 것. 따라서 column index를 할 수 있다.

Index(['Region', 'Sales', 'Amount', 'Employee'], dtype='object')

In [13]:
df.info()                     # 각 칼럼별로 null값과 자료형 보여줌

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Region    5 non-null      object
 1   Sales     5 non-null      int64
 2   Amount    5 non-null      int64
 3   Employee  5 non-null      int64
dtypes: int64(3), object(1)
memory usage: 288.0+ bytes

In [14]:
df.describe()                 # count 칼럼 당 원소 개수 ,  평균 ,  표준편차 ,  최소값 , 4분위수 , 최대값 출력

            Sales      Amount  Employee
count    5.000000    5.000000   5.00000
mean   240.000000   62.000000  13.60000
std    171.026314   39.623226  11.28273
min     50.000000   10.000000   3.00000
25%    150.000000   30.000000   5.00000
50%    200.000000   80.000000  10.00000
75%    300.000000   90.000000  20.00000
max    500.000000  100.000000  30.00000

# EDA 통계

## 1. 확인 작업  :  개수 세기, 총합

In [15]:
df.isnull().sum()                       # 결측값 (missing value) 확인, 결측값 개수 총합

Region      0
Sales       0
Amount      0
Employee    0
dtype: int64

In [24]:
df

    Region  Sales  Amount  Employee
0    Korea    300      90        20
1  America    200      80        10
2   Chaina    500     100        30
3   Canada    150      30         5
4    Italy     50      10         3

In [21]:
df['Sales'].sum()                         # 각 칼럼의 총합

1200

In [26]:
df.sum()                                   # 칼럼들의 총합

Region      KoreaAmericaChainaCanadaItaly
Sales                                1200
Amount                                310
Employee                               68
dtype: object

In [17]:
df['Sales'].value_counts()                 # 각 칼럼별로 각 행마다 값이 몇개 있는지 확인

150    1
300    1
500    1
50     1
200    1
Name: Sales, dtype: int64

In [19]:
df['Sales'].value_counts().sum()           # 각 칼럼별 각 행의 값의 개수들의 총합 확인

5

## 2. 상관관계 분석   
   
   
상관관계를 분석해서 불필요한 칼럼을 분석에서 제외한다

In [33]:
df.corr()

             Sales    Amount  Employee
Sales     1.000000  0.870641  0.982047
Amount    0.870641  1.000000  0.874607
Employee  0.982047  0.874607  1.000000

In [36]:
df['Sales'].corr(df['Employee'])                     # 세일즈와 직원의 상관관계

0.9820465567735279

## 3. 칼럼 삭제

In [40]:
df

    Region  Sales  Amount  Employee
0    Korea    300      90        20
1  America    200      80        10
2   Chaina    500     100        30
3   Canada    150      30         5
4    Italy     50      10         3

In [41]:
df.drop('Amount', axis=1, inplace=True)     # axis=0 : index   axis=1 : column        넘파이 axis=0 , axis=1 은 열, 행

In [42]:
df

    Region  Sales  Employee
0    Korea    300        20
1  America    200        10
2   Chaina    500        30
3   Canada    150         5
4    Italy     50         3

# EDA 실전

In [44]:
import pandas as pd
import seaborn as sns
tips = sns.load_dataset("tips")     # seaborn의 load_dataset 메서드 사용

In [45]:
df = pd.DataFrame(tips)
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [46]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [47]:
df.shape

(244, 7)

In [48]:
df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.3 KB

In [50]:
print(df['sex'].value_counts())
print("===========================")


print(df['time'].value_counts())
print("===========================")


print(df['smoker'].value_counts())
print("===========================")


print(df['day'].value_counts())
print("===========================")


print(df['size'].value_counts())
print("===========================")

Male      157
Female     87
Name: sex, dtype: int64
===========================
Dinner    176
Lunch      68
Name: time, dtype: int64
===========================
No     151
Yes     93
Name: smoker, dtype: int64
===========================
Sat     87
Sun     76
Thur    62
Fri     19
Name: day, dtype: int64
===========================
2    156
3     38
4     37
5      5
6      4
1      4
Name: size, dtype: int64
===========================

In [51]:
grouped = df['tip'].groupby(df['sex'])   
grouped.mean()                      # 성별에 따른 팁의 평균

sex
Male      3.089618
Female    2.833448
Name: tip, dtype: float64

In [52]:
grouped.size()                     # 성별에 따른 팁 횟수

sex
Male      157
Female     87
Name: tip, dtype: int64

# pivot

In [53]:
import os
csv_path = os.getenv("HOME") + "/Desktop/data/flights.csv"
data = pd.read_csv(csv_path)
flights = pd.DataFrame(data)
flights

     year      month  passengers
0    1949    January         112
1    1949   February         118
2    1949      March         132
3    1949      April         129
4    1949        May         121
..    ...        ...         ...
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

[144 rows x 3 columns]

In [54]:
pivot = flights.pivot(index='year', columns='month', values='passengers')
pivot

month,April,August,December,February,January,July,June,March,May,November,October,September
year,,,,,,,,,,,,
1949,129,148,118,118,112,148,135,132,121,104,119,136
1950,135,170,140,126,115,170,149,141,125,114,133,158
1951,163,199,166,150,145,199,178,178,172,146,162,184
1952,181,242,194,180,171,230,218,193,183,172,191,209
1953,235,272,201,196,196,264,243,236,229,180,211,237
1954,227,293,229,188,204,302,264,235,234,203,229,259
1955,269,347,278,233,242,364,315,267,270,237,274,312
1956,313,405,306,277,284,413,374,317,318,271,306,355
1957,348,467,336,301,315,465,422,356,355,305,347,404
1958,348,505,337,318,340,491,435,362,363,310,359,404
1959,396,559,405,342,360,548,472,406,420,362,407,463
1960,461,606,432,391,417,622,535,419,472,390,461,508